In [1]:
import pandas as pd
# df = pd.read_csv("type1_data1.csv")
df = pd.read_csv("type1_data1.csv")
df

        id   age city    f1  f2      f3    f4         f5  subscribed   views
0     id01   2.0   서울   NaN   0    gold  ENFJ  91.297791  2024-07-16  6820.0
1     id02   9.0   서울  70.0   1     NaN  ENFJ  60.339826  2024-05-12  2534.0
2     id03  27.0   서울  61.0   1    gold  ISTJ  17.252986  2024-03-16  7312.0
3     id04  75.0   서울   NaN   2     NaN  INFP  52.667078  2024-07-21   493.0
4     id05  24.0   서울  85.0   2     NaN  ISFJ  29.269869  2024-03-07  1338.0
..     ...   ...  ...   ...  ..     ...   ...        ...         ...     ...
115  id114  22.0   대구  23.0   0    gold  INTP   0.000000  2025-02-17  9747.0
116  id115  23.0   부산  65.0   0     vip  ENTP   0.000000  2025-02-17  5628.0
117  id116  23.0   서울  12.0   1  silver  INFP   0.000000  2025-02-17  1267.0
118  id117  23.0   대구  65.0   2    gold  INFP   0.000000  2025-02-17  6543.0
119  id118  24.0   부산  94.0   1     vip  ESFJ   0.000000  2025-02-17  2356.0

[120 rows x 10 columns]

In [2]:
# 1. 'f5' 컬럼이 0이 아닌 데이터(행)을 구하시오 
# 2. 앞에서 구한 데이터에 "views" 컬럼 결측치를 "views" 컬럼의 최솟값을 채워주세요 
# 3. 그리고 "views" 컬럼의 중앙값을 계산해 정수로 구하시오

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          120 non-null    object
 1   age         120 non-null    float64
 2   city        120 non-null    object
 3   f1          89 non-null     float64
 4   f2          120 non-null    int64
 5   f3          91 non-null     object
 6   f4          120 non-null    object
 7   f5          120 non-null    float64
 8   subscribed  120 non-null    object
 9   views       116 non-null    float64
dtypes: float64(4), int64(1), object(5)
memory usage: 9.5+ KB

In [4]:
df["f5"]

0      91.297791
1      60.339826
2      17.252986
3      52.667078
4      29.269869
         ...
115     0.000000
116     0.000000
117     0.000000
118     0.000000
119     0.000000
Name: f5, Length: 120, dtype: float64

In [5]:
cond = df["f5"] != 0
cond

0       True
1       True
2       True
3       True
4       True
       ...
115    False
116    False
117    False
118    False
119    False
Name: f5, Length: 120, dtype: bool

In [7]:
df = df[cond]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 102 entries, 0 to 101
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          102 non-null    object
 1   age         102 non-null    float64
 2   city        102 non-null    object
 3   f1          71 non-null     float64
 4   f2          102 non-null    int64
 5   f3          74 non-null     object
 6   f4          102 non-null    object
 7   f5          102 non-null    float64
 8   subscribed  102 non-null    object
 9   views       98 non-null     float64
dtypes: float64(4), int64(1), object(5)
memory usage: 8.8+ KB

In [11]:
# 2. 앞에서 구한 데이터에 "views" 컬럼 결측치를 "views" 컬럼의 최솟값을 채워주세요 

df["views"].isnull().sum()

np.int64(4)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 102 entries, 0 to 101
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          102 non-null    object
 1   age         102 non-null    float64
 2   city        102 non-null    object
 3   f1          71 non-null     float64
 4   f2          102 non-null    int64
 5   f3          74 non-null     object
 6   f4          102 non-null    object
 7   f5          102 non-null    float64
 8   subscribed  102 non-null    object
 9   views       98 non-null     float64
dtypes: float64(4), int64(1), object(5)
memory usage: 8.8+ KB

In [15]:
views_min = df["views"].min()
views_min

df["views"] = df["views"].fillna(views_min)

df["views"].isnull().sum()

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 102 entries, 0 to 101
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          102 non-null    object
 1   age         102 non-null    float64
 2   city        102 non-null    object
 3   f1          71 non-null     float64
 4   f2          102 non-null    int64
 5   f3          74 non-null     object
 6   f4          102 non-null    object
 7   f5          102 non-null    float64
 8   subscribed  102 non-null    object
 9   views       102 non-null    float64
dtypes: float64(4), int64(1), object(5)
memory usage: 8.8+ KB

C:\Users\krcea\AppData\Local\Temp\ipykernel_5028\4180777764.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["views"] = df["views"].fillna(views_min)

In [ ]:
# 3. 그리고 "views" 컬럼의 중앙값을 계산해 정수로 구하시오

int(df["views"].median())

5924